src/BusinessProcesses/СогласованиеРаспределенияЗаявкиФСВТС/СогласованиеРаспределенияЗаявкиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>СогласованиеРаспределенияЗаявкиФСВТС</name>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>BusinessProcessRef.РаспределениеЗаявкиФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УстановленныеВизы</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Виза</name>
      <type>
        <types>EnumRef.ВизыСогласования</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/Enums/ВизыСогласования/ВизыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВизыСогласования</name>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>СогласованоСЗамечаниями</name>
  </enumValues>
</mdclass:Enum>

src/BusinessProcesses/СогласованиеРаспределенияЗаявкиФСВТС/ObjectModule.bsl
////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТОЧЕК МАРШРУТА

#Область УстановкаВизы

Процедура УстановкаВизыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Автор 		= Автор;
		Задача.Важность 	= Перечисления.ВариантыВажностиЗадачи.Обычная;
		Задача.Предмет 		= Заявка;
		Задача.ДатаНачала	= ТекущаяДата();
		Задача.Описание		= "Необходимо согласовать распределение заявки";
	КонецЦикла; // Для Каждого Задача Из ФормируемыеЗадачи Цикл	
КонецПроцедуры // УстановкаВизыПриСозданииЗадач

Процедура УстановкаВизыПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	НайденныеВизы 	= УстановленныеВизы.НайтиСтроки(Новый Структура("Исполнитель", Задача.Исполнитель));
	Если НайденныеВизы.Количество() = 0 
		Или Не ЗначениеЗаполнено(НайденныеВизы[0].Виза) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлена виза!",,,"Виза", Отказ);
	ИначеЕсли Не НайденныеВизы[0].Виза = Перечисления.ВизыСогласования.Согласовано
		И Не ЗначениеЗаполнено(НайденныеВизы[0].Комментарий) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данной визы должен быть установлен комментарий!",,,"Комментарий", Отказ);
	КонецЕсли; // Если НайденныеВизы.Количество() = 0 Тогда
		
КонецПроцедуры // УстановкаВизыПередВыполнением

Процедура УстановкаВизыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Согласовано = Истина;
	Для Каждого Строка Из УстановленныеВизы Цикл
		Если Строка.Виза = Перечисления.ВизыСогласования.НеСогласовано Тогда
			Согласовано = Ложь;
		КонецЕсли; // Если Строка.Виза = Перечисления.ВизыСогласования.НеСогласовано Тогда		
	КонецЦикла; // Для Каждого Стока Из УстановленныеВизы Цикл	
КонецПроцедуры // УстановкаВизыПриВыполнении

#КонецОбласти

#Область Завершение

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	БизнесПроцесс 							= Основание.ПолучитьОбъект();
	БизнесПроцесс.РаспределениеСогласовано 	= Согласовано;
	БизнесПроцесс.Записать();
КонецПроцедуры // ЗавершениеПриЗавершении

#КонецОбласти

////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ БИЗНЕС ПРОЦЕССА

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли; // Если Не ЗначениеЗаполнено(Автор) Тогда
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = "Согласование распределения заявки №" + Заявка.Номер 
												+ " от " 
												+ Формат(Заявка.Дата, "ДЛФ=DD")	
												+ "/"
												+ Заявка.Заказчик
												+ "/"
												+ Заявка.НомерЗаказчика;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Наименование) Тогда	
КонецПроцедуры // ПередЗаписью
